Revit 2026 API

# PanelLockable Property

---

This property is used to know whether a panel can be locked.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Lockable { get; }
```
```vb
Public ReadOnly Property Lockable As Boolean
	Get
```
```cpp
public:
property bool Lockable {
	bool get ();
}
```
```fsharp
member Lockable : bool with get
```

#### Property Value

Boolean

If the panel can be locked, return true, else false.

#### Reference

Panel Class

Autodesk.Revit.DB Namespace